In [1]:
import pandas as pd

In [9]:
d1=pd.DataFrame()
d1

Empty DataFrame
Columns: []
Index: []

In [12]:
type(d1)

pandas.core.frame.DataFrame

In [19]:
Roll_no=[1,2,3,4,5]
name=['Azad', 'sartaz', 'sarfraz', 'sohel', 'shahrukh']
post = ['data science','data engineer','manager','senior manager','boss']
city=['hyd', 'blr','mum', 'kerla','dl']
age=[25, 30, 35,40,45]
pd.DataFrame(zip(Roll_no,name,age,post,city))

   0         1   2               3      4
0  1      Azad  25    data science    hyd
1  2    sartaz  30   data engineer    blr
2  3   sarfraz  35         manager    mum
3  4     sohel  40  senior manager  kerla
4  5  shahrukh  45            boss     dl

In [28]:
import pandas as pd
Roll_no=[1,2,3,4,5]
name=['Azad', 'sartaz', 'sarfraz', 'sohel', 'shahrukh']
age=[25, 30, 35,40,45]
post = ['data science','data engineer','manager','senior manager','boss']
city=['hyd', 'blr','mum', 'kerla','dl']
data1=zip(Roll_no,name,age,post,city)
pd.DataFrame(data1,
            columns=['Roll_no','name','age','post','city'])

   Roll_no      name  age            post   city
0        1      Azad   25    data science    hyd
1        2    sartaz   30   data engineer    blr
2        3   sarfraz   35         manager    mum
3        4     sohel   40  senior manager  kerla
4        5  shahrukh   45            boss     dl

In [35]:
import pandas as pd
Roll_no=[1,2,3,4,5]
name=['Azad', 'sartaz', 'sarfraz', 'sohel', 'shahrukh']
age=[25, 30, 35,40,45]
post = ['data science','data engineer','manager','senior manager','boss']
city=['hyd', 'blr','mum', 'kerla','dl']
data=zip(Roll_no,name,age,post,city)
cols=['Roll_no','name','age','post','city']
pd.DataFrame(data,
             columns=cols)

   Roll_no      name  age            post   city
0        1      Azad   25    data science    hyd
1        2    sartaz   30   data engineer    blr
2        3   sarfraz   35         manager    mum
3        4     sohel   40  senior manager  kerla
4        5  shahrukh   45            boss     dl

In [38]:
import pandas as pd
Roll_no=[1,2,3,4,5]
name=['Azad', 'sartaz', 'sarfraz', 'sohel', 'shahrukh']
age=[25, 30, 35,40,45]
post = ['data science','data engineer','manager','senior manager','boss']
city=['hyd', 'blr','mum', 'kerla','dl']
data=zip(Roll_no,name,age,post,city)
ix=['A','B','C','D','E']
cols=['Roll_no','name','age','post','city']
pd.DataFrame(data,
             index=ix,
             columns=cols)

   Roll_no      name  age            post   city
A        1      Azad   25    data science    hyd
B        2    sartaz   30   data engineer    blr
C        3   sarfraz   35         manager    mum
D        4     sohel   40  senior manager  kerla
E        5  shahrukh   45            boss     dl

In [1]:
import pandas as pd

In [3]:
d1=pd.DataFrame()
d1

Empty DataFrame
Columns: []
Index: []

In [1]:
a=20
b=30
c=a+b
print(c)

50